Revit 2024 API
ApplicationEntryPoint.GetRibbonPanels Method
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public override List<RibbonPanel> GetRibbonPanels()
Visual Basic
Public Overrides Function GetRibbonPanels As List(Of RibbonPanel)
Visual C++
public:
virtual List<RibbonPanel^>^ GetRibbonPanels() override
See Also
ApplicationEntryPoint Class
GetRibbonPanels Overload
Autodesk.Revit.UI.Macros Namespace